wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
/*!
    \file    gd32h77x_enet_ext.c
    \brief   ENET driver extension

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_enet.h"
#include <stdlib.h>

#if defined(GD32H77X)

#if defined   (__CC_ARM)                                    /*!< ARM compiler */

__attribute__((section(".ARM.__at_0x30000000")))  volatile enet_descriptors_struct  rxdesc_tab0[ENET_RXBUF_NUM];        /*!< ENET0 RxDMA descriptor */
__attribute__((section(".ARM.__at_0x30000160")))  volatile enet_descriptors_struct  txdesc_tab0[ENET_TXBUF_NUM];        /*!< ENET0 TxDMA descriptor */
__attribute__((section(".ARM.__at_0x30000300")))  volatile uint8_t rx_buff0[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];           /*!< ENET0 receive buffer */
__attribute__((section(".ARM.__at_0x30002100")))  volatile uint8_t tx_buff0[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];           /*!< ENET0 transmit buffer */

__attribute__((section(".ARM.__at_0x30000000")))  volatile enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM];        /*!< ENET1 RxDMA descriptor */
__attribute__((section(".ARM.__at_0x30000160")))  volatile enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM];        /*!< ENET1 TxDMA descriptor */
__attribute__((section(".ARM.__at_0x30000300")))  volatile uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];           /*!< ENET1 receive buffer */
__attribute__((section(".ARM.__at_0x30002100")))  volatile uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];           /*!< ENET1 transmit buffer */

#elif defined ( __ICCARM__ )                                /*!< IAR compiler */

#pragma location=0x30000000
volatile enet_descriptors_struct  rxdesc_tab0[ENET_RXBUF_NUM];                                                          /*!< ENET0 RxDMA descriptor */
#pragma location=0x30000160
volatile enet_descriptors_struct  txdesc_tab0[ENET_TXBUF_NUM];                                                          /*!< ENET0 TxDMA descriptor */
#pragma location=0x30000300
volatile uint8_t rx_buff0[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                                                             /*!< ENET0 receive buffer */
#pragma location=0x30002100
volatile uint8_t tx_buff0[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                                                             /*!< ENET0 transmit buffer */

#pragma location=0x30004000
volatile enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM];                                                          /*!< ENET1 RxDMA descriptor */
#pragma location=0x30004160
volatile enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM];                                                          /*!< ENET1 TxDMA descriptor */
#pragma location=0x30004300
volatile uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                                                             /*!< ENET1 receive buffer */
#pragma location=0x30006100
volatile uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                                                             /*!< ENET1 transmit buffer */


#elif defined (__GNUC__)                                    /*! GNU Compiler */

volatile enet_descriptors_struct  rxdesc_tab0[ENET_RXBUF_NUM] __attribute__((section(".ARM.__at_0x30000000")));         /*!< ENET0 RxDMA descriptor */
volatile enet_descriptors_struct  txdesc_tab0[ENET_TXBUF_NUM] __attribute__((section(".ARM.__at_0x30000160")));         /*!< ENET0 TxDMA descriptor */
volatile uint8_t rx_buff0[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]    __attribute__((section(".ARM.__at_0x30000300")));         /*!< ENET0 receive buffer */
volatile uint8_t tx_buff0[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]    __attribute__((section(".ARM.__at_0x30002100")));         /*!< ENET0 transmit buffer */

volatile enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM] __attribute__((section(".ARM.__at_0x30004000")));         /*!< ENET1 RxDMA descriptor */
volatile enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM] __attribute__((section(".ARM.__at_0x30004160")));         /*!< ENET1 TxDMA descriptor */
volatile uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE]    __attribute__((section(".ARM.__at_0x30004300")));         /*!< ENET1 receive buffer */
volatile uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE]    __attribute__((section(".ARM.__at_0x30006100")));         /*!< ENET1 transmit buffer */

#endif /* __CC_ARM */

/* ENET0 global transmit and receive descriptors pointers */
volatile enet_descriptors_struct  *dma_current_txdesc0 = NULL;
volatile enet_descriptors_struct  *dma_current_rxdesc0 = NULL;

/* ENET1 global transmit and receive descriptors pointers */
volatile enet_descriptors_struct  *dma_current_txdesc1 = NULL;
volatile enet_descriptors_struct  *dma_current_rxdesc1 = NULL;

/* ENET0 structure pointer of ptp descriptor for normal mode */
volatile enet_descriptors_struct  *dma_current_ptp_txdesc0 = NULL;
volatile enet_descriptors_struct  *dma_current_ptp_rxdesc0 = NULL;

