wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
/* ENET1 structure pointer of ptp descriptor for normal mode */
volatile enet_descriptors_struct  *dma_current_ptp_txdesc1 = NULL;
volatile enet_descriptors_struct  *dma_current_ptp_rxdesc1 = NULL;

static uint32_t enet_unknow_err = 0U;

/* change nanosecond to subsecond */
static uint32_t enet_ptp_nanosecond_2_subsecond(uint32_t nanosecond);

#define DESC_FLAG_SET_MASK                  (0xFE302080U)


/*!
    \brief      check receive frame valid and return frame size, API ID: 0x0001
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[out] none
    \retval     size of received frame: 0x0 - 0x3FFF
*/
uint32_t enet_rxframe_size_get(uint32_t enet_periph)
{
    uint32_t size = 0U;
    uint32_t status;

    /* get rdes0 information of current RxDMA descriptor */
    if(ENET0 == enet_periph) {
        /* get rdes0 information of current RxDMA descriptor */
        status = dma_current_rxdesc0->status;
    } else {
        /* get rdes0 information of current RxDMA descriptor */
        status = dma_current_rxdesc1->status;
    }

    /* if the descriptor is owned by DMA */
    if((uint32_t)RESET != (status & ENET_RDES0_DAV)) {
        size = 0U;
    }

    /* if has any error, or the frame uses two or more descriptors */
    else if((((uint32_t)RESET) != (status & ENET_RDES0_ERRS)) ||
            (((uint32_t)RESET) == (status & ENET_RDES0_LDES)) ||
            (((uint32_t)RESET) == (status & ENET_RDES0_FDES))) {
        /* drop current receive frame */
        enet_rxframe_drop(enet_periph);

        size = 1U;
    }

#if SELECT_DESCRIPTORS_ENHANCED_MODE
    /* if is an ethernet-type frame, and IP frame payload error occurred */
    else if(ENET0 == enet_periph) {
        if(((uint32_t)RESET) != (dma_current_rxdesc0->status & ENET_RDES0_FRMT) &&
                ((uint32_t)RESET) != (dma_current_rxdesc0->extended_status & ENET_RDES4_IPPLDERR)) {
            /* drop current receive frame */
            enet_rxframe_drop(enet_periph);

            size = 1U;
        }
    } else if(ENET1 == enet_periph) {
        if(((uint32_t)RESET) != (dma_current_rxdesc1->status & ENET_RDES0_FRMT) &&
                ((uint32_t)RESET) != (dma_current_rxdesc1->extended_status & ENET_RDES4_IPPLDERR)) {
            /* drop current receive frame */
            enet_rxframe_drop(enet_periph);

            size = 1U;
        }
    }
#else
    /* if is an ethernet-type frame, and IP frame payload error occurred */
    else if((((uint32_t)RESET) != (status & ENET_RDES0_FRMT)) &&
            (((uint32_t)RESET) != (status & ENET_RDES0_PCERR))) {
        /* drop current receive frame */
        enet_rxframe_drop(enet_periph);

        size = 1U;
    }
#endif /* SELECT_DESCRIPTORS_ENHANCED_MODE */

    /* if CPU owns current descriptor, no error occurred, the frame uses only one descriptor */
    else if((((uint32_t)RESET) == (status & ENET_RDES0_DAV)) &&
            (((uint32_t)RESET) == (status & ENET_RDES0_ERRS)) &&
            (((uint32_t)RESET) != (status & ENET_RDES0_LDES)) &&
            (((uint32_t)RESET) != (status & ENET_RDES0_FDES))) {
        /* get the size of the received data including CRC */
        size = GET_RDES0_FRML(status);
        /* subtract the CRC size */
        size = size - 4U;

        /* if is a type frame, and CRC is not included in forwarding frame */
        if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (status & ENET_RDES0_FRMT))) {
            size = size + 4U;
        }
    } else {
        enet_unknow_err++;
        enet_rxframe_drop(enet_periph);

        size = 1U;
    }

    /* return packet size */
    return size;
}

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in chain mode, API ID: 0x0002
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[out] none
    \retval     none
*/
void enet_descriptors_chain_init(uint32_t enet_periph, enet_dmadirection_enum direction)
{
    uint32_t num = 0U, count = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;

    if(ENET0 == enet_periph) {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            count = ENET_TXBUF_NUM;

            /* select chain mode */
            desc_status = ENET_TDES0_TCHM;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff0[num][0]);
            } else {
                desc = &rxdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff0[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

