wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff1[num][0]);
            } else {
                desc = &rxdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff1[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
        }
    }
}

/*!
    \brief      handle current received frame data to application buffer, API ID: 0x0004
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  bufsize: the size of buffer which is the parameter in function
    \param[out] buffer: pointer to the received frame data
                note -- if the input is NULL, user should copy data in application by himself
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_frame_receive(uint32_t enet_periph, uint8_t buffer[], uint32_t bufsize)
{
    uint32_t offset = 0U, size = 0U;
    ErrStatus status = ERROR;

    if(ENET0 == enet_periph){
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc0->status & ENET_RDES0_DAV)) {
            /* if buffer pointer is null, indicates that users has copied data in application */
            if(NULL != buffer) {
                /* if no error occurs, and the frame uses only one descriptor */
                if((((uint32_t)RESET) == (dma_current_rxdesc0->status & ENET_RDES0_ERRS)) &&
                        (((uint32_t)RESET) != (dma_current_rxdesc0->status & ENET_RDES0_LDES)) &&
                        (((uint32_t)RESET) != (dma_current_rxdesc0->status & ENET_RDES0_FDES))) {
                    /* get the frame length except CRC */
                    size = GET_RDES0_FRML(dma_current_rxdesc0->status);
                    size = size - 4U;

                    /* if is a type frame, and CRC is not included in forwarding frame */
                    if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc0->status & ENET_RDES0_FRMT))) {
                        size = size + 4U;
                    }

                    /* to avoid situation that the frame size exceeds the buffer length */
                    if(size <= bufsize) {
                        /* copy data from Rx buffer to application buffer */
                        for(offset = 0U; offset < size; offset++) {
                            buffer[offset] = (*(__IO uint8_t *)(uint32_t)((dma_current_rxdesc0->buffer1_addr) + offset));
                        }
                        status = SUCCESS;
                    }
                }
            } else {
                /* If buffer is NULL, user will handle data in application */
                status = SUCCESS;
            }

            /* enable reception, descriptor is owned by DMA */
            dma_current_rxdesc0->status = ENET_RDES0_DAV;

            /* check Rx buffer unavailable flag status */
            if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                /* clear RBU flag */
                ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                /* resume DMA reception by writing to the RPEN register*/
                ENET_DMA_RPEN(enet_periph) = 0U;
            }

            /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
            /* chained mode */
            if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RCHM)) {
                dma_current_rxdesc0 = (enet_descriptors_struct *)(dma_current_rxdesc0->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_rxdesc0 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_rxdesc0 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc0 + ETH_DMARXDESC_SIZE + (GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                             enet_periph))));
                }
            }
        }
    } else {
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc1->status & ENET_RDES0_DAV)) {
            /* if buffer pointer is null, indicates that users has copied data in application */
            if(NULL != buffer) {
                /* if no error occurs, and the frame uses only one descriptor */
                if((((uint32_t)RESET) == (dma_current_rxdesc1->status & ENET_RDES0_ERRS)) &&
                        (((uint32_t)RESET) != (dma_current_rxdesc1->status & ENET_RDES0_LDES)) &&
                        (((uint32_t)RESET) != (dma_current_rxdesc1->status & ENET_RDES0_FDES))) {
                    /* get the frame length except CRC */
                    size = GET_RDES0_FRML(dma_current_rxdesc1->status);
                    size = size - 4U;

                    /* if is a type frame, and CRC is not included in forwarding frame */
                    if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc1->status & ENET_RDES0_FRMT))) {
                        size = size + 4U;
                    }

                    /* to avoid situation that the frame size exceeds the buffer length */
                    if(size <= bufsize) {
                        /* copy data from Rx buffer to application buffer */
                        for(offset = 0U; offset < size; offset++) {
                            buffer[offset] = (*(__IO uint8_t *)(uint32_t)((dma_current_rxdesc1->buffer1_addr) + offset));
                        }
                        status = SUCCESS;
                    }
                }
            } else {
                /* If buffer is NULL, user will handle data in application */
                status = SUCCESS;
            }

            /* enable reception, descriptor is owned by DMA */
            dma_current_rxdesc1->status = ENET_RDES0_DAV;

            /* check Rx buffer unavailable flag status */
            if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                /* clear RBU flag */
                ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                /* resume DMA reception by writing to the RPEN register*/
                ENET_DMA_RPEN(enet_periph) = 0U;
            }

