wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                desc->buffer2_next_desc_addr = (uint32_t)(desc_tab + num + 1U);
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t)desc_tab;
            }
        }
    } else {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            buf = &tx_buff1[0][0];
            count = ENET_TXBUF_NUM;
            maxsize = ENET_TXBUF_SIZE;

            /* select chain mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TCHM | ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            buf = &rx_buff1[0][0];
            count = ENET_RXBUF_NUM;
            maxsize = ENET_RXBUF_SIZE;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
        }

        /* configuration each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            desc = desc_tab + num;

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;
            desc->buffer1_addr = (uint32_t)(&buf[num * maxsize]);

            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                desc->buffer2_next_desc_addr = (uint32_t)(desc_tab + num + 1U);
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t)desc_tab;
            }
        }
    }
}

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in enhanced ring mode with ptp function, API ID: 0x0014
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[out] none
    \retval     none
*/
void enet_ptp_enhanced_descriptors_ring_init(uint32_t enet_periph, enet_dmadirection_enum direction)
{
    uint32_t num = 0U, count = 0U, maxsize = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;
    volatile uint8_t *buf;

    if(ENET0 == enet_periph) {
        /* configure descriptor skip length */
        ENET_DMA_BCTL(enet_periph) &= ~ENET_DMA_BCTL_DPSL;
        ENET_DMA_BCTL(enet_periph) |= DMA_BCTL_DPSL(0);

        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            buf = &tx_buff0[0][0];
            count = ENET_TXBUF_NUM;
            maxsize = ENET_TXBUF_SIZE;

            /* select ring mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            buf = &rx_buff0[0][0];
            count = ENET_RXBUF_NUM;
            maxsize = ENET_RXBUF_SIZE;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* set buffer1 size */
            desc_bufsize = ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            desc = desc_tab + num;

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;
            desc->buffer1_addr = (uint32_t)(&buf[num * maxsize]);

            /* when it is the last descriptor */
            if(num == (count - 1U)) {
                if(ENET_DMA_TX == direction) {
                    /* configure transmit end of ring mode */
                    desc->status |= ENET_TDES0_TERM;
                } else {
                    /* configure receive end of ring mode */
                    desc->control_buffer_size |= ENET_RDES1_RERM;
                }
            }
        }
    } else {
        /* configure descriptor skip length */
        ENET_DMA_BCTL(enet_periph) &= ~ENET_DMA_BCTL_DPSL;
        ENET_DMA_BCTL(enet_periph) |= DMA_BCTL_DPSL(0);

        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            buf = &tx_buff1[0][0];
            count = ENET_TXBUF_NUM;
            maxsize = ENET_TXBUF_SIZE;

            /* select ring mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            buf = &rx_buff1[0][0];
            count = ENET_RXBUF_NUM;
            maxsize = ENET_RXBUF_SIZE;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* set buffer1 size */
            desc_bufsize = ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
        }

