wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
            /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
            /* chained mode */
            if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RCHM)) {
                dma_current_rxdesc0 = (enet_descriptors_struct *)(dma_current_rxdesc0->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_rxdesc0 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_rxdesc0 = (enet_descriptors_struct *)((uint32_t)dma_current_rxdesc0 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(enet_periph)));
                }
            }
        }
    } else {
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc1->status & ENET_RDES0_DAV)) {
            /* if no error occurs, and the frame uses only one descriptor */
            if(((uint32_t)RESET == (dma_current_rxdesc1->status & ENET_RDES0_ERRS)) &&
                    ((uint32_t)RESET != (dma_current_rxdesc1->status & ENET_RDES0_LDES)) &&
                    ((uint32_t)RESET != (dma_current_rxdesc1->status & ENET_RDES0_FDES))) {

                /* get the frame length except CRC */
                size = GET_RDES0_FRML(dma_current_rxdesc1->status) - 4U;

                /* if is a type frame, and CRC is not included in forwarding frame */
                if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc1->status & ENET_RDES0_FRMT))) {
                    size = size + 4U;
                }

                /* copy data from Rx buffer to application buffer if provided and size is valid */
                if((NULL != buffer) && (size <= bufsize)) {
                    for(offset = 0U; offset < size; offset++) {
                        (*(buffer + offset)) = (*(__IO uint8_t *)((dma_current_rxdesc1->buffer1_addr) + offset));
                    }

                    /* get timestamp if the pointer is not NULL */
                    if(NULL != timestamp) {
                        /* wait for ENET_RDES0_TSV flag to be set, the timestamp value is taken and
                        write to the RDES6 and RDES7 */
                        do {
                            rdes0_tsv_flag = (dma_current_rxdesc1->status & ENET_RDES0_TSV);
                            timeout++;
                        } while((RESET == rdes0_tsv_flag) && (timeout < ENET_DELAY_TO));

                        /* proceed only if timeout not reached */
                        if(ENET_DELAY_TO != timeout) {
                            /* clear the ENET_RDES0_TSV flag */
                            dma_current_rxdesc1->status &= ~ENET_RDES0_TSV;
                            /* get the timestamp value of the received frame */
                            timestamp[0] = dma_current_rxdesc1->timestamp_low;
                            timestamp[1] = dma_current_rxdesc1->timestamp_high;

                            status = SUCCESS;
                        }
                    } else {
                        /* if timestamp is not needed, operation is successful */
                        status = SUCCESS;
                    }
                } else if(NULL == buffer) {
                    /* if buffer is NULL, user will handle data in application */
                    /* get timestamp if the pointer is not NULL */
                    if(NULL != timestamp) {
                        /* wait for ENET_RDES0_TSV flag to be set */
                        do {
                            rdes0_tsv_flag = (dma_current_rxdesc1->status & ENET_RDES0_TSV);
                            timeout++;
                        } while((RESET == rdes0_tsv_flag) && (timeout < ENET_DELAY_TO));

                        /* proceed only if timeout not reached */
                        if(ENET_DELAY_TO != timeout) {
                            /* clear the ENET_RDES0_TSV flag */
                            dma_current_rxdesc1->status &= ~ENET_RDES0_TSV;
                            /* get the timestamp value of the received frame */
                            timestamp[0] = dma_current_rxdesc1->timestamp_low;
                            timestamp[1] = dma_current_rxdesc1->timestamp_high;
                        }
                    }
                    status = SUCCESS;
                }
            }

            /* regardless of success or failure, we need to restore DMA reception */
            /* enable reception, descriptor is owned by DMA */
            dma_current_rxdesc1->status = ENET_RDES0_DAV;

            /* check Rx buffer unavailable flag status */
            if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                /* Clear RBU flag */
                ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                /* resume DMA reception by writing to the RPEN register*/
                ENET_DMA_RPEN(enet_periph) = 0U;
            }

            /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
            /* chained mode */
            if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RCHM)) {
                dma_current_rxdesc1 = (enet_descriptors_struct *)(dma_current_rxdesc1->buffer2_next_desc_addr);
            } else {
                /* ring mode */
                if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RERM)) {
                    /* if is the last descriptor in table, the next descriptor is the table header */
                    dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                } else {
                    /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                    dma_current_rxdesc1 = (enet_descriptors_struct *)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(enet_periph)));
                }
            }
        }
    }

