wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
    return status;
}

/*!
    \brief      send data with timestamp values in application buffer as a transmit packet, when the DMA is in enhanced mode, API ID: 0x0016
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  buffer: pointer on the application buffer
                note -- if the input is NULL, user should copy data in application by himself
    \param[in]  length: the length of frame data to be transmitted
    \param[out] timestamp: pointer to the table which stores the timestamp high and low
                note -- if the input is NULL, timestamp is ignored
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus enet_ptpframe_transmit_enhanced_mode(uint32_t enet_periph, uint8_t buffer[], uint32_t length, uint32_t timestamp[])
{
    uint32_t offset = 0U;
    uint32_t dma_tbu_flag, dma_tu_flag;
    uint32_t tdes0_ttmss_flag;
    uint32_t timeout = 0U;
    ErrStatus status = SUCCESS;

    if(ENET0 == enet_periph) {
        /* Check if the descriptor is busy or frame length is too long */
        if(((uint32_t)RESET != (dma_current_txdesc0->status & ENET_TDES0_DAV)) ||
                (length > ENET_MAX_FRAME_SIZE)) {
            status = ERROR;
        } else {
            /* if buffer pointer is not null, copy frame data from application buffer to Tx buffer */
            if(NULL != buffer) {
                /* copy frame data from application buffer to Tx buffer */
                for(offset = 0U; offset < length; offset++) {
                    (*(__IO uint8_t *)((dma_current_txdesc0->buffer1_addr) + offset)) = (*(buffer + offset));
                }
            }

            /* set the frame length */
            dma_current_txdesc0->control_buffer_size = length;
            /* set the segment of frame, frame is transmitted in one descriptor */
            dma_current_txdesc0->status |= ENET_TDES0_LSG | ENET_TDES0_FSG;
            /* enable the DMA transmission */
            dma_current_txdesc0->status |= ENET_TDES0_DAV;

            /* check Tx buffer unavailable flag status */
            dma_tbu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TBU);
            dma_tu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TU);

            if((RESET != dma_tbu_flag) || (RESET != dma_tu_flag)) {
                /* Clear TBU and TU flag */
                ENET_DMA_STAT(enet_periph) = (dma_tbu_flag | dma_tu_flag);
                /* resume DMA transmission by writing to the TPEN register*/
                ENET_DMA_TPEN(enet_periph) = 0U;
            }

            /* if timestamp pointer is not null, wait for and get timestamp */
            if((NULL != timestamp) && (status == SUCCESS)) {
                /* wait for ENET_TDES0_TTMSS flag to be set, a timestamp was captured */
                do {
                    tdes0_ttmss_flag = (dma_current_txdesc0->status & ENET_TDES0_TTMSS);
                    timeout++;
                } while((RESET == tdes0_ttmss_flag) && (timeout < ENET_DELAY_TO));

                /* Check for timeout error */
                if(ENET_DELAY_TO == timeout) {
                    status = ERROR;
                } else {
                    /* clear the ENET_TDES0_TTMSS flag */
                    dma_current_txdesc0->status &= ~ENET_TDES0_TTMSS;
                    /* get the timestamp value of the transmit frame */
                    timestamp[0] = dma_current_txdesc0->timestamp_low;
                    timestamp[1] = dma_current_txdesc0->timestamp_high;
                }
            }

            /* Only update descriptor pointers if no error occurred */
            if(SUCCESS == status) {
                /* update the current TxDMA descriptor pointer to the next descriptor in TxDMA descriptor table*/
                /* chained mode */
                if((uint32_t)RESET != (dma_current_txdesc0->status & ENET_TDES0_TCHM)) {
                    dma_current_txdesc0 = (enet_descriptors_struct *)(dma_current_txdesc0->buffer2_next_desc_addr);
                } else {
                    /* ring mode */
                    if((uint32_t)RESET != (dma_current_txdesc0->status & ENET_TDES0_TERM)) {
                        /* if is the last descriptor in table, the next descriptor is the table header */
                        dma_current_txdesc0 = (enet_descriptors_struct *)(ENET_DMA_TDTADDR(enet_periph));
                    } else {
                        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                        dma_current_txdesc0 = (enet_descriptors_struct *)((uint32_t)dma_current_txdesc0 + ETH_DMATXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(enet_periph)));
                    }
                }
            }
        }
    } else {
        /* Check if the descriptor is busy or frame length is too long */
        if(((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_DAV)) ||
                (length > ENET_MAX_FRAME_SIZE)) {
            status = ERROR;
        } else {
            /* if buffer pointer is not null, copy frame data from application buffer to Tx buffer */
            if(NULL != buffer) {
                /* copy frame data from application buffer to Tx buffer */
                for(offset = 0U; offset < length; offset++) {
                    (*(__IO uint8_t *)((dma_current_txdesc1->buffer1_addr) + offset)) = (*(buffer + offset));
                }
            }

            /* set the frame length */
            dma_current_txdesc1->control_buffer_size = length;
            /* set the segment of frame, frame is transmitted in one descriptor */
            dma_current_txdesc1->status |= ENET_TDES0_LSG | ENET_TDES0_FSG;
            /* enable the DMA transmission */
            dma_current_txdesc1->status |= ENET_TDES0_DAV;

            /* check Tx buffer unavailable flag status */
            dma_tbu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TBU);
            dma_tu_flag = (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_TU);

            if((RESET != dma_tbu_flag) || (RESET != dma_tu_flag)) {
                /* Clear TBU and TU flag */
                ENET_DMA_STAT(enet_periph) = (dma_tbu_flag | dma_tu_flag);
                /* resume DMA transmission by writing to the TPEN register*/
                ENET_DMA_TPEN(enet_periph) = 0U;
            }

            /* if timestamp pointer is not null, wait for and get timestamp */
            if((NULL != timestamp) && (status == SUCCESS)) {
                /* wait for ENET_TDES0_TTMSS flag to be set, a timestamp was captured */
                do {
                    tdes0_ttmss_flag = (dma_current_txdesc1->status & ENET_TDES0_TTMSS);
                    timeout++;
                } while((RESET == tdes0_ttmss_flag) && (timeout < ENET_DELAY_TO));

                /* Check for timeout error */
                if(ENET_DELAY_TO == timeout) {
                    status = ERROR;
                } else {
                    /* clear the ENET_TDES0_TTMSS flag */
                    dma_current_txdesc1->status &= ~ENET_TDES0_TTMSS;
                    /* get the timestamp value of the transmit frame */
                    timestamp[0] = dma_current_txdesc1->timestamp_low;
                    timestamp[1] = dma_current_txdesc1->timestamp_high;
                }
            }

            /* Only update descriptor pointers if no error occurred */
            if(SUCCESS == status) {
                /* update the current TxDMA descriptor pointer to the next descriptor in TxDMA descriptor table*/
                /* chained mode */
                if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TCHM)) {
                    dma_current_txdesc1 = (enet_descriptors_struct *)(dma_current_txdesc1->buffer2_next_desc_addr);
                } else {
                    /* ring mode */
                    if((uint32_t)RESET != (dma_current_txdesc1->status & ENET_TDES0_TERM)) {
                        /* if is the last descriptor in table, the next descriptor is the table header */
                        dma_current_txdesc1 = (enet_descriptors_struct *)(ENET_DMA_TDTADDR(enet_periph));
                    } else {
                        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                        dma_current_txdesc1 = (enet_descriptors_struct *)((uint32_t)dma_current_txdesc1 + ETH_DMATXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(enet_periph)));
                    }
                }
            }
        }
    }

