wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
    return status;
}

#else

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in normal chain mode with PTP function, API ID: 0x0017
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[in]  desc_ptptab: pointer to the first descriptor address of PTP descriptor table
    \param[out] none
    \retval     none
*/
void enet_ptp_normal_descriptors_chain_init(uint32_t enet_periph, enet_dmadirection_enum direction, enet_descriptors_struct desc_ptptab[])
{
    uint32_t num = 0U, count = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;

    if(ENET0 == enet_periph) {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            count = ENET_TXBUF_NUM;

            /* select chain mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TCHM | ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
            dma_current_ptp_txdesc0 = desc_ptptab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
            dma_current_ptp_rxdesc0 = desc_ptptab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff0[num][0]);
            } else {
                desc = &rxdesc_tab0[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff0[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                if(ENET_DMA_TX == direction) {
                    desc->buffer2_next_desc_addr = (uint32_t)(&txdesc_tab0[num + 1U]);
                } else {
                    desc->buffer2_next_desc_addr = (uint32_t)(&rxdesc_tab0[num + 1U]);
                }
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t)desc_tab;
            }
            /* set desc_ptptab equal to desc_tab */
            (&desc_ptptab[num])->buffer1_addr = desc->buffer1_addr;
            (&desc_ptptab[num])->buffer2_next_desc_addr = desc->buffer2_next_desc_addr;
        }
        /* when it is the last ptp descriptor, preserve the first descriptor
        address of desc_ptptab in ptp descriptor status */
        (&desc_ptptab[num - 1U])->status = (uint32_t)desc_ptptab;
    } else {
        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab1;
            count = ENET_TXBUF_NUM;

            /* select chain mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TCHM | ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc1 = desc_tab;
            dma_current_ptp_txdesc1 = desc_ptptab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab1;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive chained mode and set buffer1 size */
            desc_bufsize = ENET_RDES1_RCHM | (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc1 = desc_tab;
            dma_current_ptp_rxdesc1 = desc_ptptab;
        }

        /* configure each descriptor */
        for(num = 0U; num < count; num++) {
            /* get the pointer to the next descriptor of the descriptor table */
            if(ENET_DMA_TX == direction) {
                desc = &txdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&tx_buff1[num][0]);
            } else {
                desc = &rxdesc_tab1[num];
                desc->buffer1_addr = (uint32_t)(&rx_buff1[num][0]);
            }

            /* configure descriptors */
            desc->status = desc_status;
            desc->control_buffer_size = desc_bufsize;

            /* if is not the last descriptor */
            if(num < (count - 1U)) {
                /* configure the next descriptor address */
                if(ENET_DMA_TX == direction) {
                    desc->buffer2_next_desc_addr = (uint32_t)(&txdesc_tab1[num + 1U]);
                } else {
                    desc->buffer2_next_desc_addr = (uint32_t)(&rxdesc_tab1[num + 1U]);
                }
            } else {
                /* when it is the last descriptor, the next descriptor address
                equals to first descriptor address in descriptor table */
                desc->buffer2_next_desc_addr = (uint32_t)desc_tab;
            }
            /* set desc_ptptab equal to desc_tab */
            (&desc_ptptab[num])->buffer1_addr = desc->buffer1_addr;
            (&desc_ptptab[num])->buffer2_next_desc_addr = desc->buffer2_next_desc_addr;
        }
        /* when it is the last ptp descriptor, preserve the first descriptor
        address of desc_ptptab in ptp descriptor status */
        (&desc_ptptab[num - 1U])->status = (uint32_t)desc_ptptab;
    }
}

/*!
    \brief      initialize the DMA Tx/Rx descriptors's parameters in normal ring mode with PTP function, API ID: 0x0018
    \param[in]  enet_periph: ENETx(x=0,1)
    \param[in]  direction: the descriptors which users want to init, refer to enet_dmadirection_enum,
                only one parameter can be selected which is shown as below
      \arg        ENET_DMA_TX: DMA Tx descriptors
      \arg        ENET_DMA_RX: DMA Rx descriptors
    \param[in]  desc_ptptab: pointer to the first descriptor address of PTP descriptor table
    \param[out] none
    \retval     none
*/
void enet_ptp_normal_descriptors_ring_init(uint32_t enet_periph, enet_dmadirection_enum direction, enet_descriptors_struct desc_ptptab[])
{
    uint32_t num = 0U, count = 0U;
    uint32_t desc_status = 0U, desc_bufsize = 0U;
    volatile enet_descriptors_struct *desc;
    volatile enet_descriptors_struct *desc_tab;

    if(ENET0 == enet_periph) {
        /* configure descriptor skip length */
        ENET_DMA_BCTL(enet_periph) &= ~ENET_DMA_BCTL_DPSL;
        ENET_DMA_BCTL(enet_periph) |= DMA_BCTL_DPSL(0);

        /* if want to initialize DMA Tx descriptors */
        if(ENET_DMA_TX == direction) {
            /* save a copy of the DMA Tx descriptors */
            desc_tab = txdesc_tab0;
            count = ENET_TXBUF_NUM;

            /* select ring mode, and enable transmit timestamp function */
            desc_status = ENET_TDES0_TTSEN;

            /* configure DMA Tx descriptor table address register */
            ENET_DMA_TDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_txdesc0 = desc_tab;
            dma_current_ptp_txdesc0 = desc_ptptab;
        } else {
            /* if want to initialize DMA Rx descriptors */
            /* save a copy of the DMA Rx descriptors */
            desc_tab = rxdesc_tab0;
            count = ENET_RXBUF_NUM;

            /* enable receiving */
            desc_status = ENET_RDES0_DAV;
            /* select receive ring mode and set buffer1 size */
            desc_bufsize = (uint32_t)ENET_RXBUF_SIZE;

            /* configure DMA Rx descriptor table address register */
            ENET_DMA_RDTADDR(enet_periph) = (uint32_t)desc_tab;
            dma_current_rxdesc0 = desc_tab;
            dma_current_ptp_rxdesc0 = desc_ptptab;
        }

