wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/ENET/Telnet/src/gd32h77x_enet_ext.c
            if(status == SUCCESS) {
                /* copy timestamp value from Rx descriptor to application array */
                if(NULL != timestamp) {
                    timestamp[0] = dma_current_rxdesc0->buffer1_addr;
                    timestamp[1] = dma_current_rxdesc0->buffer2_next_desc_addr;
                }

                dma_current_rxdesc0->buffer1_addr = dma_current_ptp_rxdesc0->buffer1_addr;
                dma_current_rxdesc0->buffer2_next_desc_addr = dma_current_ptp_rxdesc0->buffer2_next_desc_addr;

                /* enable reception, descriptor is owned by DMA */
                dma_current_rxdesc0->status = ENET_RDES0_DAV;

                /* check Rx buffer unavailable flag status */
                if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                    /* clear RBU flag */
                    ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                    /* resume DMA reception by writing to the RPEN register*/
                    ENET_DMA_RPEN(enet_periph) = 0U;
                }

                /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
                /* chained mode */
                if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RCHM)) {
                    dma_current_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->buffer2_next_desc_addr);
                    /* if it is the last ptp descriptor */
                    if(0U != dma_current_ptp_rxdesc0->status) {
                        /* pointer back to the first ptp descriptor address in the desc_ptptab list address */
                        dma_current_ptp_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->status);
                    } else {
                        /* pointer to the next ptp descriptor */
                        dma_current_ptp_rxdesc0++;
                    }
                } else {
                    /* ring mode */
                    if((uint32_t)RESET != (dma_current_rxdesc0->control_buffer_size & ENET_RDES1_RERM)) {
                        /* if is the last descriptor in table, the next descriptor is the table header */
                        dma_current_rxdesc0 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                        /* RDES2 and RDES3 will not be covered by buffer address, so do not need to preserve a new table,
                        use the same table with RxDMA descriptor */
                        dma_current_ptp_rxdesc0 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc0->status);
                    } else {
                        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                        dma_current_rxdesc0 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc0 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                                 enet_periph)));
                        dma_current_ptp_rxdesc0++;
                    }
                }
            }
        }
    } else {
        /* the descriptor is busy due to own by the DMA */
        if((uint32_t)RESET == (dma_current_rxdesc1->status & ENET_RDES0_DAV)) {
            /* if buffer pointer is null, indicates that users has copied data in application */
            if(NULL != buffer) {
                /* if no error occurs, and the frame uses only one descriptor */
                if(((uint32_t)RESET == (dma_current_rxdesc1->status & ENET_RDES0_ERRS)) &&
                        ((uint32_t)RESET != (dma_current_rxdesc1->status & ENET_RDES0_LDES)) &&
                        ((uint32_t)RESET != (dma_current_rxdesc1->status & ENET_RDES0_FDES))) {

                    /* get the frame length except CRC */
                    size = GET_RDES0_FRML(dma_current_rxdesc1->status) - 4U;
                    /* if is a type frame, and CRC is not included in forwarding frame */
                    if((RESET != (ENET_MAC_CFG(enet_periph) & ENET_MAC_CFG_TFCD)) && (RESET != (dma_current_rxdesc1->status & ENET_RDES0_FRMT))) {
                        size = size + 4U;
                    }

                    /* to avoid situation that the frame size exceeds the buffer length */
                    if(size <= bufsize) {
                        /* copy data from Rx buffer to application buffer */
                        for(offset = 0U; offset < size; offset++) {
                            buffer[offset] = (*(__IO uint8_t *)(uint32_t)((dma_current_ptp_rxdesc1->buffer1_addr) + offset));
                        }
                        status = SUCCESS;
                    }
                }
            } else {
                status = SUCCESS;
            }

            if(status == SUCCESS) {
                /* copy timestamp value from Rx descriptor to application array */
                if(NULL != timestamp) {
                    timestamp[0] = dma_current_rxdesc1->buffer1_addr;
                    timestamp[1] = dma_current_rxdesc1->buffer2_next_desc_addr;
                }

                dma_current_rxdesc1->buffer1_addr = dma_current_ptp_rxdesc1->buffer1_addr;
                dma_current_rxdesc1->buffer2_next_desc_addr = dma_current_ptp_rxdesc1->buffer2_next_desc_addr;

                /* enable reception, descriptor is owned by DMA */
                dma_current_rxdesc1->status = ENET_RDES0_DAV;

                /* check Rx buffer unavailable flag status */
                if((uint32_t)RESET != (ENET_DMA_STAT(enet_periph) & ENET_DMA_STAT_RBU)) {
                    /* clear RBU flag */
                    ENET_DMA_STAT(enet_periph) = ENET_DMA_STAT_RBU;
                    /* resume DMA reception by writing to the RPEN register*/
                    ENET_DMA_RPEN(enet_periph) = 0U;
                }

                /* update the current RxDMA descriptor pointer to the next descriptor in RxDMA descriptor table */
                /* chained mode */
                if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RCHM)) {
                    dma_current_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->buffer2_next_desc_addr);
                    /* if it is the last ptp descriptor */
                    if(0U != dma_current_ptp_rxdesc1->status) {
                        /* pointer back to the first ptp descriptor address in the desc_ptptab list address */
                        dma_current_ptp_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->status);
                    } else {
                        /* pointer to the next ptp descriptor */
                        dma_current_ptp_rxdesc1++;
                    }
                } else {
                    /* ring mode */
                    if((uint32_t)RESET != (dma_current_rxdesc1->control_buffer_size & ENET_RDES1_RERM)) {
                        /* if is the last descriptor in table, the next descriptor is the table header */
                        dma_current_rxdesc1 = (enet_descriptors_struct *)(ENET_DMA_RDTADDR(enet_periph));
                        /* RDES2 and RDES3 will not be covered by buffer address, so do not need to preserve a new table,
                        use the same table with RxDMA descriptor */
                        dma_current_ptp_rxdesc1 = (enet_descriptors_struct *)(dma_current_ptp_rxdesc1->status);
                    } else {
                        /* the next descriptor is the current address, add the descriptor size, and descriptor skip length */
                        dma_current_rxdesc1 = (enet_descriptors_struct *)(uint32_t)((uint32_t)dma_current_rxdesc1 + ETH_DMARXDESC_SIZE + GET_DMA_BCTL_DPSL(ENET_DMA_BCTL(
                                                 enet_periph)));
                        dma_current_ptp_rxdesc1++;
                    }
                }
            }
        }
    }

